In [1]:
import pandas as pd
df=pd.read_csv("sample2.csv") #df=pd.read_csv("sample2.csv",skiprows=1,2,3) To skip rows from csv file

In [2]:
df

       SR.      NAME  GENDER   AGE       DATE         COUNTRY
0      1.0      Dett    Male  18.0  21/05/2015  Great Britain
1      2.0     Nern   Female  19.0  15/10/2017         France
2      3.0   Kallsie    Male  20.0  16/08/2016         France
3      4.0     Siuau  Female  21.0  21/05/2015  Great Britain
4      5.0  Shennice    Male  22.0  21/05/2016         France
...    ...       ...     ...   ...         ...            ...
15718  NaN       NaN     NaN   NaN         NaN            NaN
15719  NaN       NaN     NaN   NaN         NaN            NaN
15720  NaN       NaN     NaN   NaN         NaN            NaN
15721  NaN       NaN     NaN   NaN         NaN            NaN
15722  NaN       NaN     NaN   NaN         NaN            NaN

[15723 rows x 6 columns]

You can skip this header or tell column datatype by just passing some number of arguments in read_csv() function.

> when you don't have header in your csv file.

df=pd.read_csv("sample2.csv",header=None,names=["Col1","Col2","Col3"])

> If you want to read number of rows from a csv file

In [3]:
df_3rows=pd.read_csv("sample2.csv",nrows=3)  
df_3rows

   SR.     NAME  GENDER  AGE       DATE         COUNTRY
0    1     Dett    Male   18  21/05/2015  Great Britain
1    2    Nern   Female   19  15/10/2017         France
2    3  Kallsie    Male   20  16/08/2016         France

you can just mention n.a., not available or any other value which you want to replace with NaN

In [4]:
df_3rows=pd.read_csv("sample2.csv",na_values=["n.a.","not available"])

In [5]:
'''df12 = pd. read_csv ("stock_data.csv", na_values={
'eps': ["not available","n.a."],
'revenue': ["not available", "n.a.", -1],
'people': ["not available","n.a."]
})'''
#for specific columnn you can pass a dictionary instead of a list

'df12 = pd. read_csv ("stock_data.csv", na_values={\n\'eps\': ["not available","n.a."],\n\'revenue\': ["not available", "n.a.", -1],\n\'people\': ["not available","n.a."]\n})'

In [6]:
type(df)

pandas.core.frame.DataFrame

> If we want to know the data type of every coloumn, we will simply do-

In [49]:
df.dtypes

SR.        float64
NAME        object
GENDER      object
AGE        float64
DATE        object
COUNTRY     object
dtype: object

Object is nothing but a String.

> If we want to read specific number of lines from a csv file,

In [8]:
df.head(n=10)

    SR.      NAME  GENDER   AGE       DATE         COUNTRY
0   1.0      Dett    Male  18.0  21/05/2015  Great Britain
1   2.0     Nern   Female  19.0  15/10/2017         France
2   3.0   Kallsie    Male  20.0  16/08/2016         France
3   4.0     Siuau  Female  21.0  21/05/2015  Great Britain
4   5.0  Shennice    Male  22.0  21/05/2016         France
5   6.0    Chasse  Female  23.0  15/10/2018         France
6   7.0    Tommye    Male  24.0  16/08/2017  United States
7   8.0   Dorcast  Female  25.0  21/05/2016  United States
8   9.0   Angelee    Male  26.0  21/05/2017  Great Britain
9  10.0   Willoom  Female  27.0  15/10/2019         France

> If we want to read specific number of line from bottom of our csv file-

In [9]:
df.tail()

       SR. NAME GENDER  AGE DATE  COUNTRY
15718  NaN  NaN    NaN  NaN   NaN     NaN
15719  NaN  NaN    NaN  NaN   NaN     NaN
15720  NaN  NaN    NaN  NaN   NaN     NaN
15721  NaN  NaN    NaN  NaN   NaN     NaN
15722  NaN  NaN    NaN  NaN   NaN     NaN

Here NaN describes- Not A Number

> If we want to know size of our csv file in terms of rows and column :

In [10]:
df.shape

(15723, 6)

In [11]:
rows,column=df.shape
print(rows,column)

15723 6

> Now If we want to create our own data frame like an excel sheet then, -

In [12]:
temp = pd.DataFrame({"No.":["1","2","3"],"Name":["ABC","XYZ","PQR"],"Age":[50,28,34] })

In [13]:
temp

  No. Name  Age
0   1  ABC   50
1   2  XYZ   28
2   3  PQR   34

In [14]:
temp.dtypes

No.     object
Name    object
Age      int64
dtype: object

Another way to create a DataFrame using list of tuples

In [15]:
weather_data = [
('1/1/2017', 32,6, 'Rain'),
('1/2/2017', 35,7, 'Sunny'), 
('1/3/2017', 28, 2, 'Snow')
]
df1 = pd.DataFrame (weather_data, columns=["day", "temperature", "windspeed", "event"])
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

> To Convert String Datetime to actual datatype:

In [16]:
pd.to_datetime("2023-jan-23")

Timestamp('2023-01-23 00:00:00')

> If we want to convert multiple dates, then pass them into a list-

In [17]:
pd.to_datetime(["2023-5-27","2020-7-23","2022-8-21"])

DatetimeIndex(['2023-05-27', '2020-07-23', '2022-08-21'], dtype='datetime64[ns]', freq=None)

> Let's Convert a String datetime csv column into datetime datatype. Before that let's create a temporary 
dataframe.

In [18]:
temp1=pd.DataFrame({"No.":[1,2,3],"Name":["ABC","XYZ","PQR"],"Date":["2023-5-27","2020-7-23","2022-8-21"]})

In [19]:
temp1.sort_values(by=["Date"],ascending=False).head(n=1)

   No. Name       Date
0    1  ABC  2023-5-27

> Datatype of Date column is still String:

In [20]:
temp1.dtypes

No.      int64
Name    object
Date    object
dtype: object

> Now let's convert Date column in to Datetime Datatype:

In [21]:
temp1["Date"] = pd.to_datetime(temp1["Date"])

> Let's Check the Datatype of Date column-

In [22]:
temp1.dtypes

No.              int64
Name            object
Date    datetime64[ns]
dtype: object

> Hence, the datatype of Date Column has been changed.

> If there is any error in Datetime list then simply add this into passing function-

In [23]:
pd.to_datetime(["2023-5-27","2020-7-23","ABC"],errors="coerce")

DatetimeIndex(['2023-05-27', '2020-07-23', 'NaT'], dtype='datetime64[ns]', freq=None)

> NaT : Not a Time

> Now, Let's convert String to integer datatype:

In [24]:
temp2=pd.DataFrame({"No.":["1","2","3"],"Name":["ABC","XYZ","PQR"]})

In [25]:
temp2

  No. Name
0   1  ABC
1   2  XYZ
2   3  PQR

In [26]:
temp2["No."] = pd.to_numeric(temp2["No."])

In [27]:
temp2.dtypes

No.      int64
Name    object
dtype: object

If we want to know all the facts about our csv file data, then-

In [28]:
df.describe(include="all")

                SR.   NAME  GENDER          AGE       DATE  COUNTRY
count   2561.000000   2561    2561  2561.000000        2561    2561
unique          NaN     16       2          NaN          36       3
top             NaN  Nern   Female          NaN  21/05/2021  France
freq            NaN    162    2330          NaN         130    1265
mean    1281.000000    NaN     NaN    44.695822         NaN     NaN
std      739.441343    NaN     NaN    12.877246         NaN     NaN
min        1.000000    NaN     NaN    18.000000         NaN     NaN
25%      641.000000    NaN     NaN    36.000000         NaN     NaN
50%     1281.000000    NaN     NaN    46.000000         NaN     NaN
75%     1921.000000    NaN     NaN    55.000000         NaN     NaN
max     2561.000000    NaN     NaN    65.000000         NaN     NaN

> you can simply replace include="all" with any specific column name.

> Count of Unique Name in our dataframe

In [29]:
df["NAME"].value_counts()

Nern        162
Kallsie     162
Siuau       162
Shennice    162
Chasse      162
Tommye      162
Dorcast     162
Angelee     162
Willoom     162
Waeston     162
Rosma       162
Felisaas    162
Demetas     162
Jeromyw     162
Rashid      162
Dett        131
Name: NAME, dtype: int64

> Top 5 values from this list-

In [30]:
df["NAME"].value_counts().head()

Nern        162
Kallsie     162
Siuau       162
Shennice    162
Chasse      162
Name: NAME, dtype: int64

> If we want to access specific number of rows and columns from a csv file:

In [31]:
df.iloc[0:4,0:5]  #Starting row : end+1 row , Starting Column: end+1 column

   SR.     NAME  GENDER   AGE       DATE
0  1.0     Dett    Male  18.0  21/05/2015
1  2.0    Nern   Female  19.0  15/10/2017
2  3.0  Kallsie    Male  20.0  16/08/2016
3  4.0    Siuau  Female  21.0  21/05/2015

You can also do it like that-

In [32]:
df.iloc[0:5,[1,3]]

       NAME   AGE
0      Dett  18.0
1     Nern   19.0
2   Kallsie  20.0
3     Siuau  21.0
4  Shennice  22.0

In [33]:
df.iloc[0:6]

   SR.      NAME  GENDER   AGE       DATE         COUNTRY
0  1.0      Dett    Male  18.0  21/05/2015  Great Britain
1  2.0     Nern   Female  19.0  15/10/2017         France
2  3.0   Kallsie    Male  20.0  16/08/2016         France
3  4.0     Siuau  Female  21.0  21/05/2015  Great Britain
4  5.0  Shennice    Male  22.0  21/05/2016         France
5  6.0    Chasse  Female  23.0  15/10/2018         France

In [34]:
df.iloc[:,3:5]

        AGE       DATE
0      18.0  21/05/2015
1      19.0  15/10/2017
2      20.0  16/08/2016
3      21.0  21/05/2015
4      22.0  21/05/2016
...     ...         ...
15718   NaN         NaN
15719   NaN         NaN
15720   NaN         NaN
15721   NaN         NaN
15722   NaN         NaN

[15723 rows x 2 columns]

In [35]:
withoutLast=df.iloc[:,:-1] # It will produce all the rows and columns except last column
print(df.shape)
withoutLast.shape

(15723, 6)

(15723, 5)

You can also access range of rows and columns with the help of their names. That is called label based indexing

In [36]:
df.loc[:,"AGE"]

0        18.0
1        19.0
2        20.0
3        21.0
4        22.0
         ...
15718     NaN
15719     NaN
15720     NaN
15721     NaN
15722     NaN
Name: AGE, Length: 15723, dtype: float64

In [37]:
df[["NAME","AGE"]]  #This is a shortcut to access any column with the help of their name.

           NAME   AGE
0          Dett  18.0
1         Nern   19.0
2       Kallsie  20.0
3         Siuau  21.0
4      Shennice  22.0
...         ...   ...
15718       NaN   NaN
15719       NaN   NaN
15720       NaN   NaN
15721       NaN   NaN
15722       NaN   NaN

[15723 rows x 2 columns]

In [38]:
df.loc[:,"NAME"]   #It will produce series

0            Dett
1           Nern
2         Kallsie
3           Siuau
4        Shennice
           ...
15718         NaN
15719         NaN
15720         NaN
15721         NaN
15722         NaN
Name: NAME, Length: 15723, dtype: object

In [39]:
df.loc[:,["NAME"]]

           NAME
0          Dett
1         Nern
2       Kallsie
3         Siuau
4      Shennice
...         ...
15718       NaN
15719       NaN
15720       NaN
15721       NaN
15722       NaN

[15723 rows x 1 columns]

In [40]:
df.iloc[0:5]   #will give first 5 rows and all columns

   SR.      NAME  GENDER   AGE       DATE         COUNTRY
0  1.0      Dett    Male  18.0  21/05/2015  Great Britain
1  2.0     Nern   Female  19.0  15/10/2017         France
2  3.0   Kallsie    Male  20.0  16/08/2016         France
3  4.0     Siuau  Female  21.0  21/05/2015  Great Britain
4  5.0  Shennice    Male  22.0  21/05/2016         France

some other function of pandas

In [41]:
df["AGE"].max()

65.0

If we want to know maximum age alog with the person name

In [42]:
df.loc[df["AGE"]==df["AGE"].max(),["NAME","AGE"]].reset_index()

    index    NAME   AGE
0      47  Rashid  65.0
1      95  Rashid  65.0
2     143  Rashid  65.0
3     191  Rashid  65.0
4     239  Rashid  65.0
..    ...     ...   ...
59   2420  Rashid  65.0
60   2451  Rashid  65.0
61   2482  Rashid  65.0
62   2513  Rashid  65.0
63   2544  Rashid  65.0

[64 rows x 3 columns]

In [43]:
df["NAME"][df["AGE"]==df["AGE"].max()].reset_index()  #Alternate way to do the same

    index    NAME
0      47  Rashid
1      95  Rashid
2     143  Rashid
3     191  Rashid
4     239  Rashid
..    ...     ...
59   2420  Rashid
60   2451  Rashid
61   2482  Rashid
62   2513  Rashid
63   2544  Rashid

[64 rows x 2 columns]

In [44]:
df["AGE"].min()

18.0

In [45]:
df["NAME"][df["AGE"]>40.0]

23       Dorcast
24       Angelee
25       Willoom
26       Waeston
27         Rosma
          ...
2556    Felisaas
2557     Demetas
2558     Jeromyw
2559      Rashid
2560        Dett
Name: NAME, Length: 1610, dtype: object

In [46]:
df["NAME"][df["COUNTRY"]=="France"]

1          Nern
2        Kallsie
4       Shennice
5         Chasse
9        Willoom
          ...
2552     Angelee
2553     Willoom
2557     Demetas
2559      Rashid
2560        Dett
Name: NAME, Length: 1265, dtype: object

In [47]:
df["AGE"].mean()

44.69582194455291

In [48]:
df.loc[df["COUNTRY"]=="France",["NAME","AGE"]]

          NAME   AGE
1        Nern   19.0
2      Kallsie  20.0
4     Shennice  22.0
5       Chasse  23.0
9      Willoom  27.0
...        ...   ...
2552   Angelee  42.0
2553   Willoom  43.0
2557   Demetas  47.0
2559    Rashid  49.0
2560      Dett  50.0

[1265 rows x 2 columns]